ehughes/rt_super_z/bringup/pin_cfg/B/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_FULLDRIVE_DI 0x00u     /*!<@brief Normal drive */
#define IOPCTL_PIO_FULLDRIVE_EN 0x0100u   /*!<@brief Full drive enable */
#define IOPCTL_PIO_FUNC0 0x00u            /*!<@brief Selects pin function 0 */
#define IOPCTL_PIO_FUNC1 0x01u            /*!<@brief Selects pin function 1 */
#define IOPCTL_PIO_INBUF_DI 0x00u         /*!<@brief Disable input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_INV_EN 0x0800u         /*!<@brief Input function is inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PULLUP_EN 0x20u        /*!<@brief Enable pull-up function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_PUPD_EN 0x10u          /*!<@brief Enable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*! @name PDM_CLK01 (coord R1), U40[4]/U41[4]/PDM_CLK01_OnBoard
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITPINS_PDM_CLK01_PERIPHERAL DMIC0
/*!
 * @brief Signal name */
#define BOARD_INITPINS_PDM_CLK01_SIGNAL CLK
/*!
 * @brief Signal channel */
#define BOARD_INITPINS_PDM_CLK01_CHANNEL 0_1
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITPINS_PDM_CLK01_PORT 2U
/*!
 * @brief PORT pin number */
#define BOARD_INITPINS_PDM_CLK01_PIN 16U
/*!
 * @brief PORT pin mask */
#define BOARD_INITPINS_PDM_CLK01_PIN_MASK (1U << 16U)
/* @} */

/*! @name PDM_CLK23 (coord U1), U19[D5]
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_PDM_CLK23_PERIPHERAL DMIC0          /*!<@brief Peripheral name */
#define BOARD_INITPINS_PDM_CLK23_SIGNAL CLK                /*!<@brief Signal name */
#define BOARD_INITPINS_PDM_CLK23_CHANNEL 2_3               /*!<@brief Signal channel */
#define BOARD_INITPINS_PDM_CLK23_PORT 2U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PDM_CLK23_PIN 17U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PDM_CLK23_PIN_MASK (1U << 17U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PDM_CLK45 (coord R2), U19[E3]
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_PDM_CLK45_PERIPHERAL DMIC0          /*!<@brief Peripheral name */
#define BOARD_INITPINS_PDM_CLK45_SIGNAL CLK                /*!<@brief Signal name */
#define BOARD_INITPINS_PDM_CLK45_CHANNEL 4_5               /*!<@brief Signal channel */
#define BOARD_INITPINS_PDM_CLK45_PORT 2U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PDM_CLK45_PIN 18U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PDM_CLK45_PIN_MASK (1U << 18U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PDM_CLK67 (coord T2), U19[C2]
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_PDM_CLK67_PERIPHERAL DMIC0          /*!<@brief Peripheral name */
#define BOARD_INITPINS_PDM_CLK67_SIGNAL CLK                /*!<@brief Signal name */
#define BOARD_INITPINS_PDM_CLK67_CHANNEL 6_7               /*!<@brief Signal channel */
#define BOARD_INITPINS_PDM_CLK67_PORT 2U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PDM_CLK67_PIN 19U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PDM_CLK67_PIN_MASK (1U << 19U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PDM_DATA01 (coord U2), U40[1]/U41[1]/PDM_DATA01_OnBoard
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITPINS_PDM_DATA01_PERIPHERAL DMIC0
/*!
 * @brief Signal name */
#define BOARD_INITPINS_PDM_DATA01_SIGNAL DATA
/*!
 * @brief Signal channel */
#define BOARD_INITPINS_PDM_DATA01_CHANNEL 0_1
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITPINS_PDM_DATA01_PORT 2U
/*!
 * @brief PORT pin number */
#define BOARD_INITPINS_PDM_DATA01_PIN 20U
/*!
 * @brief PORT pin mask */
#define BOARD_INITPINS_PDM_DATA01_PIN_MASK (1U << 20U)
/* @} */

/*! @name PDM_DATA23 (coord R3), J31[6]
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_PDM_DATA23_PERIPHERAL DMIC0          /*!<@brief Peripheral name */
#define BOARD_INITPINS_PDM_DATA23_SIGNAL DATA               /*!<@brief Signal name */
#define BOARD_INITPINS_PDM_DATA23_CHANNEL 2_3               /*!<@brief Signal channel */
#define BOARD_INITPINS_PDM_DATA23_PORT 2U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PDM_DATA23_PIN 21U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PDM_DATA23_PIN_MASK (1U << 21U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PDM_DATA45 (coord P3), U19[E2]
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_PDM_DATA45_PERIPHERAL DMIC0          /*!<@brief Peripheral name */
#define BOARD_INITPINS_PDM_DATA45_SIGNAL DATA               /*!<@brief Signal name */
#define BOARD_INITPINS_PDM_DATA45_CHANNEL 4_5               /*!<@brief Signal channel */
#define BOARD_INITPINS_PDM_DATA45_PORT 2U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PDM_DATA45_PIN 22U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PDM_DATA45_PIN_MASK (1U << 22U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PDM_DATA67 (coord P5), U19[E1]
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_PDM_DATA67_PERIPHERAL DMIC0          /*!<@brief Peripheral name */
#define BOARD_INITPINS_PDM_DATA67_SIGNAL DATA               /*!<@brief Signal name */
#define BOARD_INITPINS_PDM_DATA67_CHANNEL 6_7               /*!<@brief Signal channel */
#define BOARD_INITPINS_PDM_DATA67_PORT 2U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PDM_DATA67_PIN 23U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PDM_DATA67_PIN_MASK (1U << 23U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name FC0_TXD_SCL_MISO_WS (coord G2), J16[1]/U27[3]/U9[12]
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_DEBUG_UART_TXD_PERIPHERAL FLEXCOMM0         /*!<@brief Peripheral name */
#define BOARD_INITPINS_DEBUG_UART_TXD_SIGNAL TXD_SCL_MISO_WS       /*!<@brief Signal name */
#define BOARD_INITPINS_DEBUG_UART_TXD_PORT 0U                      /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_DEBUG_UART_TXD_PIN 1U                       /*!<@brief PORT pin number */
#define BOARD_INITPINS_DEBUG_UART_TXD_PIN_MASK (1U << 1U)          /*!<@brief PORT pin mask */
                                                                   /* @} */

/*! @name FC0_RXD_SDA_MOSI_DATA (coord G4), JP21[2]/U28[3]/U9[13]
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_DEBUG_UART_RXD_PERIPHERAL FLEXCOMM0           /*!<@brief Peripheral name */
#define BOARD_INITPINS_DEBUG_UART_RXD_SIGNAL RXD_SDA_MOSI_DATA       /*!<@brief Signal name */
#define BOARD_INITPINS_DEBUG_UART_RXD_PORT 0U                        /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_DEBUG_UART_RXD_PIN 2U                         /*!<@brief PORT pin number */
#define BOARD_INITPINS_DEBUG_UART_RXD_PIN_MASK (1U << 2U)            /*!<@brief PORT pin mask */
                                                                     /* @} */

/*! @name I3C0_PUR (coord B6), J18[3]
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_I3C0_PUR_PERIPHERAL I3C            /*!<@brief Peripheral name */
#define BOARD_INITPINS_I3C0_PUR_SIGNAL PUR                /*!<@brief Signal name */
#define BOARD_INITPINS_I3C0_PUR_PORT 2U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_I3C0_PUR_PIN 31U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_I3C0_PUR_PIN_MASK (1U << 31U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name I3C0_SCL (coord N17), J18[1]/U8[2]/U17[A6]/SCL_CODEC
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_I3C0_SCL_PERIPHERAL I3C                         /*!<@brief Peripheral name */
#define BOARD_INITPINS_I3C0_SCL_SIGNAL SCL                             /*!<@brief Signal name */
#define BOARD_INITPINS_I3C0_SCL_PORT 2U                                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_I3C0_SCL_PIN 29U                                /*!<@brief PORT pin number */
#define BOARD_INITPINS_I3C0_SCL_PIN_MASK (1U << 29U)                   /*!<@brief PORT pin mask */
                                                                       /* @} */

