ehughes/rt_super_z/bringup/pin_cfg/B/board/pin_mux.h
/*! @name I3C0_SDA (coord P16), J18[2]/U8[3]/U17[B6]/SDA_CODEC
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_I3C0_SDA_PERIPHERAL I3C                         /*!<@brief Peripheral name */
#define BOARD_INITPINS_I3C0_SDA_SIGNAL SDA                             /*!<@brief Signal name */
#define BOARD_INITPINS_I3C0_SDA_PORT 2U                                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_I3C0_SDA_PIN 30U                                /*!<@brief PORT pin number */
#define BOARD_INITPINS_I3C0_SDA_PIN_MASK (1U << 30U)                   /*!<@brief PORT pin mask */
                                                                       /* @} */

/*! @name FC2_SCK (coord A3), Q4[5]
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_LED_GREEN_PERIPHERAL FLEXCOMM2      /*!<@brief Peripheral name */
#define BOARD_INITPINS_LED_GREEN_SIGNAL SCK                /*!<@brief Signal name */
#define BOARD_INITPINS_LED_GREEN_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LED_GREEN_PIN 14U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LED_GREEN_PIN_MASK (1U << 14U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name HS_SPI_MISO (coord M2), U19[D2]
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_LCD_MISO_PERIPHERAL FLEXCOMM14     /*!<@brief Peripheral name */
#define BOARD_INITPINS_LCD_MISO_SIGNAL MISO               /*!<@brief Signal name */
#define BOARD_INITPINS_LCD_MISO_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LCD_MISO_PIN 12U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LCD_MISO_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name HS_SPI_MOSI (coord N1), U19[C4]
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_LCD_MOSI_PERIPHERAL FLEXCOMM14              /*!<@brief Peripheral name */
#define BOARD_INITPINS_LCD_MOSI_SIGNAL MOSI                        /*!<@brief Signal name */
#define BOARD_INITPINS_LCD_MOSI_PORT 1U                            /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LCD_MOSI_PIN 13U                            /*!<@brief PORT pin number */
#define BOARD_INITPINS_LCD_MOSI_PIN_MASK (1U << 13U)               /*!<@brief PORT pin mask */
                                                                   /* @} */

/*! @name HS_SPI_SCK (coord L2), U19[D3]
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_LCD_SCK_PERIPHERAL FLEXCOMM14     /*!<@brief Peripheral name */
#define BOARD_INITPINS_LCD_SCK_SIGNAL SCK                /*!<@brief Signal name */
#define BOARD_INITPINS_LCD_SCK_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LCD_SCK_PIN 11U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LCD_SCK_PIN_MASK (1U << 11U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name FC5_RXD_SDA_MOSI_DATA (coord J16), J28[4]/JP30[1]/J45[22]
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_ACC_INT_PERIPHERAL FLEXCOMM5           /*!<@brief Peripheral name */
#define BOARD_INITPINS_ACC_INT_SIGNAL RXD_SDA_MOSI_DATA       /*!<@brief Signal name */
#define BOARD_INITPINS_ACC_INT_PORT 1U                        /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_ACC_INT_PIN 5U                         /*!<@brief PORT pin number */
#define BOARD_INITPINS_ACC_INT_PIN_MASK (1U << 5U)            /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PIO2_5 (coord U13), LCD_CMD_DATA
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_LCD_CMD_DATA_PERIPHERAL GPIO                    /*!<@brief Peripheral name */
#define BOARD_INITPINS_LCD_CMD_DATA_SIGNAL PIO2                        /*!<@brief Signal name */
#define BOARD_INITPINS_LCD_CMD_DATA_CHANNEL 5                          /*!<@brief Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LCD_CMD_DATA_GPIO GPIO                          /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_LCD_CMD_DATA_GPIO_PIN_MASK (1U << 5U)           /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_LCD_CMD_DATA_PORT 2U                            /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LCD_CMD_DATA_PIN 5U                             /*!<@brief PORT pin number */
#define BOARD_INITPINS_LCD_CMD_DATA_PIN_MASK (1U << 5U)                /*!<@brief PORT pin mask */
                                                                       /* @} */

/*! @name PIO2_6 (coord U15), LCD_RST
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_LCD_RST_PERIPHERAL GPIO                    /*!<@brief Peripheral name */
#define BOARD_INITPINS_LCD_RST_SIGNAL PIO2                        /*!<@brief Signal name */
#define BOARD_INITPINS_LCD_RST_CHANNEL 6                          /*!<@brief Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LCD_RST_GPIO GPIO                          /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_LCD_RST_GPIO_PIN_MASK (1U << 6U)           /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_LCD_RST_PORT 2U                            /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LCD_RST_PIN 6U                             /*!<@brief PORT pin number */
#define BOARD_INITPINS_LCD_RST_PIN_MASK (1U << 6U)                /*!<@brief PORT pin mask */
                                                                  /* @} */

/*! @name PIO2_7 (coord U16), LCD_BL
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_LCD_BL_PERIPHERAL GPIO                    /*!<@brief Peripheral name */
#define BOARD_INITPINS_LCD_BL_SIGNAL PIO2                        /*!<@brief Signal name */
#define BOARD_INITPINS_LCD_BL_CHANNEL 7                          /*!<@brief Signal channel */

