ehughes/rt_super_z/bringup/pin_cfg/B/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LCD_BL_GPIO GPIO                          /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_LCD_BL_GPIO_PIN_MASK (1U << 7U)           /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_LCD_BL_PORT 2U                            /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LCD_BL_PIN 7U                             /*!<@brief PORT pin number */
#define BOARD_INITPINS_LCD_BL_PIN_MASK (1U << 7U)                /*!<@brief PORT pin mask */
                                                                 /* @} */

/*! @name PIO1_14 (coord N2), SPI_SSEL
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_SPI_SSEL_PERIPHERAL GPIO                    /*!<@brief Peripheral name */
#define BOARD_INITPINS_SPI_SSEL_SIGNAL PIO1                        /*!<@brief Signal name */
#define BOARD_INITPINS_SPI_SSEL_CHANNEL 14                         /*!<@brief Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SPI_SSEL_GPIO GPIO                          /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_SPI_SSEL_GPIO_PIN_MASK (1U << 14U)          /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_SPI_SSEL_PORT 1U                            /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SPI_SSEL_PIN 14U                            /*!<@brief PORT pin number */
#define BOARD_INITPINS_SPI_SSEL_PIN_MASK (1U << 14U)               /*!<@brief PORT pin mask */
                                                                   /* @} */

/*! @name PIO0_26 (coord A2), TP5
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_TP5_PERIPHERAL GPIO                    /*!<@brief Peripheral name */
#define BOARD_INITPINS_TP5_SIGNAL PIO0                        /*!<@brief Signal name */
#define BOARD_INITPINS_TP5_CHANNEL 26                         /*!<@brief Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_TP5_GPIO GPIO                          /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_TP5_GPIO_PIN_MASK (1U << 26U)          /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_TP5_PORT 0U                            /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_TP5_PIN 26U                            /*!<@brief PORT pin number */
#define BOARD_INITPINS_TP5_PIN_MASK (1U << 26U)               /*!<@brief PORT pin mask */
                                                              /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void); /* Function assigned for the Cortex-M33 */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
